clear all;
tic;

load 0.dat
load -ASCII x.dat
load -ASCII y.dat
surf (x, y, X0);
hold on;
set(0,'DefaultAxesFontSize',24,'DefaultAxesFontName','Times New Roman');
set(0,'DefaultTextFontSize',24,'DefaultTextFontName','Times New Roman'); 
%text (36.8, 45.13, '(е)', 'FontSize', 28);
%text(36.89, 44.97, 'в.д.', 'FontSize', 28);
ylabel ( 'с.ш.', 'FontSize', 28);
{
plot(36.45,45.1333, 'k.');%Набережное
plot(36.4167, 45.2, 'k.');%Челядиново
plot(36.4333, 45.2333, 'k.');%Южная Керчь
plot(36.45, 45.2667, 'k.');%Приозерное
plot(36.5, 45.3, 'r*');%Левый край моста
plot(36.5, 45.2667, 'r*');%Левый край моста 1
plot(36.5167, 45.3167, 'k.');%Керчь
plot(36.6167,45.3167, 'k.');%Западная керчь 
plot(36.65,45.4, 'k.');%Глазовка
plot(36.6333, 45.4333, 'r*');%Овосины 
plot(36.55, 45.45, 'k.');%Юркино 
plot(36.3333, 45.0333, 'k.');%Яковенково 
plot(36.4667, 45.0833, 'r*');%Заветное

plot(36.75, 45.4333, 'k.');%Ильич
plot(36.75, 45.3833, 'k.');%Батарейка
plot(36.7167, 45.25, 'k.');%Тамань
plot(36.9333, 45.3, 'k.');%Волна революции
plot(36.6, 45.2333, 'r*');%Правый край моста
plot(36.5833,45.2167, 'r*');%Правый край моста1
plot(36.5833, 45.1833, 'k.');%озеро Тузла 
plot(36.8667, 45.2667, 'k.');%Приморский 
plot(36.6, 45.1333, 'k.');%мыс Панагия
plot(36.7, 45.0833, 'k.');%Волна
plot(36.85, 45.0833, 'r*');%Артющенко
plot(36.8, 45.45, 'r*');%Приазовский
}
{
plot(36.9667,45.4333, 'k.');%Кучугуры
plot(36.0333, 45.4167, 'k.');%Новоотрадное
plot(36.7667, 46.7167, 'k.');%Бердянск
plot(37.3833, 45.3667, 'k.');%Темрюк
plot(37.9833, 46.0833, 'k.');%Приморско-Ахтарск
plot(35.4, 46.35, 'k.');%Кирилловка
plot(37.8833, 46.3833, 'k.');%Камышеватская
plot(37.5333, 47.0333, 'k.');%Мариуполь
plot(35.1667, 45.5833, 'k.');%озеро Сиваш
plot(37.5833, 45.6333, 'k.');%Приазовский государственный природный заказник
}
shading interp;
view (0,90);
c = colorbar;
xlabel(c, 'м', 'FontSize', 24);
ax = gca;
axpos = get(ax, 'Position');
cpos = get(c, 'Position');
cpos(3) = 0.5*cpos(3);
set(c, 'Position', cpos);
set(ax, 'Position', axpos);
axis([35.9 37.3 44.55 45.7]);%ЧМ сценарий 1
axis([36.3 36.9 45.1 45.5]); %Для отрисовки пролива
axis([35 38 45.35 47]); %Для отрисовки Азовского моря
axis( [36.3 37 45 45.5] );%мареографы в проливе

set( ax, 'xtick', [36.4:0.2:36.8]);%пролив
set( ax, 'ytick', [45.1:0.15:48]);

set( ax, 'xtick', [36:0.4:38]);%чм1
set( ax, 'ytick', [44.6:0.4:48]);
grid on;
box on;

toc;
